import React from "react";

import { SafeArea } from "@components/utils/safe-area.component";
import { ScrollContainer } from "./profile.styles.ts";
import { Text, Spacer } from "@components";

export const PrivacyPolicy = () => {
  return (
    <SafeArea>
      <ScrollContainer>
        <Spacer position="bottom" size="medium">
          <Text variant="body">
            Информация относно Администратора на лични данни и координати за
            контакт:
          </Text>
        </Spacer>
        <Spacer position="bottom" size="medium">
          <Text variant="body">Име: ШЕФС ПЛЕЙС ООД</Text>
          <Text variant="body">Държава: България</Text>
          <Text variant="body">Град: София</Text>
          <Text variant="body">
            Адрес: ж.к. „Свoбода“, бл. 2, вх. Е, ап.97, ет.3
          </Text>
          <Text variant="body">Тел. Номер:+ 359 882 400 573</Text>
          <Text variant="body">Имейл: chefsplace [at] chefsplace.bg </Text>
        </Spacer>
        <Text variant="body">
          ШЕФС ПЛЕЙС ООД ООД (Дружество) е администратор на лични данни съгласно
          европейският регламент за защита на личните данни (GDPR). Информация
          относно надзорния орган за защита на личните данни, към гото могат да
          се подават само жалби:
        </Text>
        <Spacer position="bottom" size="medium">
          <Text variant="body">Име: Комисия за защита на личните данни </Text>
          <Text variant="body">Държава: България </Text>
          <Text variant="body">
            Адрес: бул. „Проф. Цветан Лазаров” № 2 Град: София
          </Text>
        </Spacer>
        <Spacer position="bottom" size="medium">
          <Text variant="body">
            Комисията за защита на личните данни /КЗЛД/ е органът към който
            всяко лице има право да подаде жалба. Всяко физическо лице, чийто
            лични данни са обработвани от Администратора може да подаде жалба до
            комисията лично, чрез писмо, по електронен път, през сайта на
            комисията или чрез факс. Жалбата трябва да съдържа данни за
            жалбоподателя, естество на жалбата, друга информация при
            необходимост, дата и подпис. Комисията има образец, който да Ви
            насочи, при необходимост.
          </Text>
        </Spacer>
        <Spacer position="bottom" size="medium">
          <Text variant="body">
            Въведение: За целите на изпълнение на законовите си задължения и
            предвид необходимостта от предоставяне на адекватна защита на
            личните данни на своите клиенти и контрагенти физически лица,
            Дружеството внедри във дейноста си, политика за защита на личните
            данни, ведно със съпътстващите я процедури, декларации и други
            документи. Освен внедрените документи, Дружеството предприе
            необходимите мерки за тази защита, чрез поставяне на пароли и нива
            на достъп до сърварите, в които се съхраняват вашите лични данни,
            както и контрол на логовете, антивирусни програми, защитни стени и
            други мерки, с цел действителна защита на предоставените от вас
            лични данни.
          </Text>
        </Spacer>
        <Text variant="body">
          Цели: ШЕФС ПЛЕЙС ООД гарантира, че предоставените лични дании се
          използват само за изпълнение на предвидените от дружеството цели за
          това, а именно: Комуникация с клиенти и потребителии осъществяване на
          контактна връзка с представители на дружеството; Обслужване на клиенти
          във връзка с изпълнение на договорни задължния по осъществената
          покупко-продажба; Обсужване на потребителите, чрез изпращане на
          рекламни съобщения за промоционални продукти и предстоящи кампании. За
          посочените по-горе цели, на мобилното приложение на дружеството се
          събират следните ваши лични данни: две имена,e-mailадрес, телефонен
          номер и адрес на доставка.
        </Text>
        <Spacer position="bottom" size="medium" />
        <Text variant="body">
          Срокът на съхранение на предоставените от Вас лични данни, се определя
          съгласно законовите изисквания в Република България, но във всеки
          случаи, освен когато имате създаден от вас профил,същият не може да
          бъде по-дълъг от 10години. Когато сте създали профил, данните описани
          в него ще се съхраняват до момента, в който ни изпратите електронно
          съобщение, в което ни информирате, че желаете профилът ви да бъде
          изтрит.
        </Text>
        <Spacer position="bottom" size="medium" />
        <Text variant="body">
          Права: Дружеството осигурява спазването правата на физическите лица,
          чиито лични данни се събират и обработват, което включва:
          <Spacer position="bottom" size="small">
            <Text>1. право на информираност за обработка на лични данни;</Text>
          </Spacer>
          <Spacer position="bottom" size="small">
            <Text>
              2. право на достъп до личните данни – с какви данни се разполага;
            </Text>
          </Spacer>
          <Spacer position="bottom" size="small">
            <Text>3. право на коригиране на неточни лични данни;</Text>
          </Spacer>
          <Spacer position="bottom" size="small">
            <Text>
              4. право на изтриване на лични данни – правото ”да бъдеш забравен”
              – в предвидените от закона случаи;
            </Text>
          </Spacer>
          <Spacer position="bottom" size="small">
            <Text>
              5. право на ограничаване на обработваните лични данни - в
              предвидените от закона случаи;
            </Text>
          </Spacer>
          <Spacer position="bottom" size="small">
            <Text>
              6. правото на информираност за действия в резултат на искане за
              коригиране, изтриване или ограничаване на обработването на лични
              данни;
            </Text>
          </Spacer>
          <Spacer position="bottom" size="small">
            <Text>
              7. право на преносимост на данните – в случай че дружеството
              притежева необходимите технически възможности да го направи;
            </Text>
          </Spacer>
          <Spacer position="bottom" size="small">
            <Text>
              8. право на възражение срещу обработване на лични данни - в
              предвидените от закона случаи;
            </Text>
          </Spacer>
          <Spacer position="bottom" size="small">
            <Text>
              9. право да не са обект на автоматично вземане на решение,
              включващо профилиране.
            </Text>
          </Spacer>
          <Spacer position="bottom" size="small">
            <Text>
              Може да упражните всичките си права относно защита на Вашите лични
              данни, като отправите исканията чрез изпращане на електронно
              съобщение, в което подробно описвате, какво право желаете да
              упражните, на следния e-mail адрес: chefsplace [at] chefsplace.bg.
              В случай на нарушаване на правата Ви, съгласно горепосоченото или
              приложимото законодателство за защита на личните данни, имате
              право да подадете жалба до Комисията за защита на личните данни,
              информация за която е дадена на първа страница.
            </Text>
          </Spacer>
          Разкриване на Вашите лични данни и трансфер на лични данни:
          Дружеството не извършва трансфер на лични данни. Вашите лични данни
          няма да бъдат трансферирани в друга държава. Възможно е да се наложи –
          по закон, при съдебен процес, при съдебен спор и/или по заявка от
          страна на обществени и правителствени органи в или извън Вашата страна
          на местоживеене – Дружеството да разкрие личната Ви информация.
          Възможно е и да разкрием информация за Вас, ако установим, че за
          целите на националната сигурност, правоприлагането или други проблеми
          от обществена значимост, такова разкриване е необходимо или уместно.
        </Text>
        <Spacer position="bottom" />
        <Text>
          Може да бъдат споделени лични данни на лице с което Дружеството има
          договорни отношения. В тези случаи Дружеството споделя информация за
          Вас с трети лица, например със счетоводна фирма(при осчетоводяването
          на покупка), като същото е въвело механизми, с които гарантира, че се
          предоставя ниво на защита на данните според уговорения стандарт за
          това.
        </Text>
        <Spacer position="bottom" />
        <Text>
          Заключителни разпоредби: Дружеството НЕ събира лична информация от
          лица на възраст под 18 години. Ако научим, че сме събрали лична
          информация за лица на възраст под 18 години, ще предприемем стъпки, за
          да изтрием информацията възможно най-скоро. С цел да прилагаме
          най-актуалните мерки за защита и с цел спазване на действащото
          законодателство, ние ще актуализираме редовно настоящата Политика за
          поверителност. Ако промените, които направим, са съществени, можем да
          публикуваме съобщение за направените промени в нашия интернет сайт.
          Приканваме Ви редовно да преглеждате текущия вариант на тази Политика
          за поверителност, да бъдете постоянно информирани за това, как ние се
          грижим за защитата на личните данни, които събираме.
        </Text>
      </ScrollContainer>
    </SafeArea>
  );
};
