export const termsContent: {
  subtitle?: string;
  contents: string[];
}[] = [
  {
    contents: [
      "Внимание! Внимателно прочетете тези условия, преди да използвате този уеб сайт. Ако използвате този уеб сайт се счита, че приемате и сте съгласни с тези условия. Ако не приемате тези условия, не използвайте този уеб сайт!",
      "Настоящите общи условия уреждат взаимоотношенията между  Фирма Шефс Плейс ЕООД (наричан по-долу Chefsplace.bg) от една страна и Потребителите на електронни (Интернет) страници и услуги, намиращи се на домейн Chefsplace.bg (наричани за краткост Сайт), както и отношенията със същите, когато използват информационните и търговски услуги предлагани от Шефс Плейс ЕООД (наричани за краткост Услуги).",
      "Тези условия обвързват всички потребители. С натискането на всеки един обект, линк или бутон разположени на страниците на Chefsplace.bg (с изключение на линка към настроящите Общи условия) Потребителят се съгласява, изцяло приема и се задължава да спазва настоящите Общи условия.",
      "Фирма Шефс Плейс ЕООД е дружество, регистрирано по Търговския закон на Република България, със седалище и адрес за контакти: гр. София, район р-н Надежда ж.к. Свобода, бл. 2, вх. Е, ет. 3, ап. 97, ЕИК: 204531178, ДДС номер: BG204531178.",
    ],
  },

  {
    subtitle: "Условия за използване на Сайта на Chefsplace.bg",
    contents: [
      'Потребителят разбира и приема обстоятелството, че информационните услуги и Сайта се предоставят "във вида, в който са" и това, че Chefsplace.bg не поема никаква отговорност за навременността, изтриването и невъзможността да бъде доставена информация относно завършени поръчки на Потребителя, негови или на други Потребители мнения и оценки за продукти, информация за не налични продукти, както и за нанесени щети, пропуснати ползи и други вреди, настъпили след, в резултата на или поради използване (или пък невъзможност за използване поради технически проблеми, профилактика, решения на администратора и др.) на Сайта. В случай, че в следствие на използването на този Сайт или материали от него доведе до възникването на вреди, за които е необходим ремонт или поправка на оборудване или информация Потребителят поема цялата отговорност и всички разходи, свързани с отстраняването на нанесените вреди.',
    ],
  },
  {
    subtitle: "Задължения на потребителя при регистриране",
    contents: [
      "Предвид ползването на Сайта на Chefsplace.bg, Потребителят се съгласява:\na) да предостави вярна, точна, актуална и пълна информация за себе си при попълване на регистрационната форма (наричана оттук нататък с общото наименование Лични данни)\nб) да внася при нужда промени в тези Лични данни с оглед на тяхната вярност, точност, актуалност и изчерпателност.",
      "В случай, че Потребителят предостави фалшива, неточна, неактуална или непълна информация, Chefsplace.bg има право да закрие и/или изтрие информацията за неговия пощенски адрес и да му откаже по-нататъшен достъп до част или до всички свои услуги.",
    ],
  },
];
