export const termsContent: {
  subtitle?: string;
  contents: string[];
}[] = [
  {
    contents: [
      "Внимание! Внимателно прочетете тези условия, преди да използвате настоящето мобилно приложение. Ако използвате това мобилно приложение се счита, че приемате и сте съгласни с тези условия. Ако не приемате тези условия, не използвайте това мобилно приложение!",
      "Настоящите общи условия уреждат взаимоотношенията между фирма Шефс Плейс ЕООД (наричан по-долу Chefsplace) от една страна и Потребителите на това мобилно приложение и предлаганите от него услуги, както и отношенията със същите, когато използват информационните и търговски услуги предлагани от Шефс Плейс ЕООД (наричани за краткост Услуги).",
      "Тези условия обвързват всички потребители. С натискането на всеки един обект, линк или бутон разположени на страниците на Chefsplace.bg (с изключение на линка към настроящите Общи условия) Потребителят се съгласява, изцяло приема и се задължава да спазва настоящите Общи условия.",
      "Фирма Шефс Плейс ЕООД е дружество, регистрирано по Търговския закон на Република България, със седалище и адрес за контакти: гр. София, район р-н Надежда ж.к. Свобода, бл. 2, вх. Е, ет. 3, ап. 97, ЕИК: 204531178, ДДС номер: BG204531178.",
    ],
  },

  {
    subtitle: "Условия за използване на мобилното приложение на Chefsplace",
    contents: [
      'Потребителят разбира и приема обстоятелството, че информационните услуги и мобилното приложение се предоставят "във вида, в който са" и това, че Chefsplace не поема никаква отговорност за навременността, изтриването и невъзможността да бъде доставена информация относно завършени поръчки на Потребителя, негови или на други Потребители мнения и оценки за продукти, информация за не налични продукти, както и за нанесени щети, пропуснати ползи и други вреди, настъпили след, в резултата на или поради използване (или пък невъзможност за използване поради технически проблеми, профилактика, решения на администратора и др.) на мобилното приложение. В случай, че в следствие на използването на тово мобилното приложение или материали от него доведе до възникването на вреди, за които е необходим ремонт или поправка на оборудване или информация Потребителят поема цялата отговорност и всички разходи, свързани с отстраняването на нанесените вреди.',
    ],
  },
  {
    subtitle: "Задължения на потребителя при регистриране",
    contents: [
      "Предвид ползването на мобилното приложение на Chefsplace.bg, Потребителят се съгласява:\na) да предостави вярна, точна, актуална и пълна информация за себе си при попълване на регистрационната форма (наричана оттук нататък с общото наименование Лични данни)\nб) да внася при нужда промени в тези Лични данни с оглед на тяхната вярност, точност, актуалност и изчерпателност.",
      "В случай, че Потребителят предостави фалшива, неточна, неактуална или непълна информация, Chefsplace.bg има право да закрие и/или изтрие информацията за неговия пощенски адрес и да му откаже по-нататъшен достъп до част или до всички свои услуги.",
    ],
  },
  {
    subtitle: "Защита на личните данни. Kонфиденциална политика на Chefsplace",
    contents: [
      "Съобразно Закона за защита на личните данни, Потребителят има право на достъп до собствените си Лични данни, които е въвел или са станали достояние на Chefsplace при ползване от него на Сайта, както и на поправка на тези Лични данни.",
      "Приемайки настоящите условия Потребителите, които са регистрирали потребителско име и парола изрично се съгласяват предоставените от тях Лични данни (включително избраните потребителско име и парола) да бъдат обработвани от Chefsplace по електронен път при доставка на поръчани стоки или услуги и при необходимост от помощ от служител на Chefsplace",
      "Всички доброволно предоставени от Потребителя Лични данни и други Данни, които го идентифицират в процеса на ползване на Сайта се съхраняват, обработват и използват от Chefsplace за целите на поддръжка на определени функционалности на предлаганите услуги и за целите на рекламата на стоки и услуги предлагани във всички сайтове на Фирма Шефс Плейс ЕООД.",
      "Chefsplace изрично уведомява Потребителя, че предоставените от Потребителя Лични данни не се отстъпват на трети лица за рекламни и промоционални цели.",
    ],
  },
  {
    subtitle: "Достъп, потребителско име и парола, сигурност",
    contents: [
      "Потребителят получава желаните от него потребителско име (в случай, че не се ползва от вече регистриран потребител) и парола за достъп до всички услуги на Chefsplace, след като извърши процеса на регистрация.",
      "Потребителят е отговорен за поддържане на конфиденциалността на получените потребителско име и парола. С използването им декларира, че той лично и от свое име е изцяло отговорен за всички дейности, достъпът, до които се извършват с неговите потребителско име и парола.",
      "Потребителят се съгласява да уведоми незабавно Chefsplace за всяко неоторизирано използване на потребителското си име и парола и или за всяко друго нарушаване на сигурността.",
      "В случай на загубване (забравяне) на паролата и изрично искане от страна на Потребителя, Chefsplace автоматично ще изпрати e-mail съобщение съдържащо регистрираното потребителско име и парола на предоставения от потребителя в процеса на регистрация адрес за електронна поща.",
      "Chefsplace не носи отговорност за каквито и да е щети и загуби, възникнали поради неспазване на разпоредбите на настоящата точка.",
    ],
  },
  {
    subtitle: "Поведение на потребителите",
    contents: [
      "Потребителите на мобилното приложение разбират, че информацията, данните, публикуваните мнения, текст, софтуер, музика, звук, фотоси или всякакви други материали (наречени общо по-нататък 'Съдържание'), които стават публично достояние или се предават конфиденциално, са отговорност единствено на човека, който генерира това Съдържание.",
      "Потребителят, ползващ  мобилното приложение е изцяло отговорен за публикуваното или предавано по друг начин, предоставен от мобилното приложение, Съдържание. Chefsplace не гарантира точността, цялостта, верността или характера на изпращано и разпостранявано чрез мобилното приложение Съдържание.",
      "Потребителят се съгласява да НЕ използва мобилното приложение Chefsplace, за да:\nа) формулира, изпраща или предава по някакъв друг начин Съдържание, което е незаконно, вредно, заплашващо, обиждащо, предизвикващо безпокойство, нараняващо, дискредитиращо, вулгарно, неприлично, клеветящо, нарушаващо конфиденциалността на другия или неприемливо от гледна точка на расови, етнически или други причини;\nб) създава рекламно съдържание на стоки и услуги извън Сайта, както и да публикува интернет адреси сочещи към страници и услуги извън Сайта, с изключение на местата където това е изрично посочено като разрешено.\nв) причинява вреда на децата по какъвто и да е начин;\nг) се представя за човек или група хора, включително и, но не само за: представител на Chefsplace.bg, представител на производител и др., както и по друг начин да заблуждава относно принадлежността си към група хора или отделен човек;\nд) фалшифицира хедъри или по друг начин да манипулира идентификационните средства с цел да се завоалира произходът на Съдържание, предавано чрез Сайта;\nе) да формулира, изпраща, публикува или да предава по друг начин Съдържание, което няма право да предава по закон или в резултат на други договорни или поверителни отношения (като вътрешна информация, конфиденциална информация или информация относно нечия собственост, получена в резултат на наемни отношения, или която е предмет на споразумения за неразгласяване);\nж) да формулира, изпраща, публикува или да предава по друг начин Съдържание, което нарушава каквото и да е патентно, търговско, авторско или друго пpаво на собственост ('Права') на която и да е страна;\nз) да формулира, изпраща, публикува или да предава по друг начин неразрешени рекламни материали, junk mail, spam, 'верижни писма', пренасочени с alias поддомейни, 'пирамидални схеми' или други форми за привличане на клиенти;\nи) да формулира, изпраща, публикува или да предава по друг начин материали, съдържащи компютърни вируси или други компютърни кодове, файлове или програми, предназначени да прекъсват, разстройват или ограничават функционирането на компютърен софтуер, хардуер или телекомуникационно оборудване;\nй) да нарушава нормалната работа на другите ползватели на Сайта, включително и ако не я ползва, да въздейства по какъвто и да е друг начин, който влияе отрицателно върху възможността на другите ползватели да участвуват в обмен в реално време;\nк) да пречи за предоставяне на услугите на Сайта или нарушава работата на сървъри или мрежи, свързани с услугите, да не се спазват изискванията, процедурите, политиката или разпоредбите на мрежите, свързани с Сайта;\nл) да нарушава преднамерено или непреднамеренно местни, национални или международни закони;\nм) да преследва или по друг начин да безпокои друг Потребител;\nн) да събира и използва неправомерно персонална информация за други потребители.\nChefsplace си запазва правото да ограничава и/или отказва достъпа до Сайта на потребители, които еднократно или системно нарушават изброените в точка 5 изисквания.\nChefsplace си запазва правото да редактира и премахва информация предоставенa от потребителя в нарушение на изброените по-горе в точка 5 изисквания.",
    ],
  },
];
